
Функция ЗаписатьЗначение(Проект, ИД, Дата, План, ОценкаЧЧ) Экспорт

	Если НЕ ЗначениеЗаполнено(ИД) Тогда
	
		ИД = Новый УникальныйИдентификатор;
	
	КонецЕсли; 
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекущееЗначение = ПрочитатьЗначение(Проект, ИД, Дата, Пользователь);
	
	Если ТекущееЗначение.План <> План ИЛИ ТекущееЗначение.ОценкаЧЧ <> ОценкаЧЧ Тогда
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Проект = Проект;
		МенеджерЗаписи.ИД = ИД;
		МенеджерЗаписи.Дата = Дата;
		МенеджерЗаписи.План = План;
		МенеджерЗаписи.ОценкаЧЧ = ОценкаЧЧ;
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;		
КонецФункции
 
Функция ПрочитатьЗначение(Проект, ИД, Дата, Пользователь = Неопределено) экспорт
	
	Если Пользователь = Неопределено Тогда
	
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСПлан.Проект,
		|	РСПлан.ИД,
		|	РСПлан.Дата,
		|	РСПлан.Пользователь,
		|	РСПлан.План,
		|	РСПлан.ОценкаЧЧ
		|ИЗ
		|	РегистрСведений.План КАК РСПлан
		|ГДЕ
		|	РСПлан.Проект = &Проект
		|	И РСПлан.ИД = &ИД
		|	И РСПлан.Дата = &Дата
		|	И РСПлан.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ИД", ИД);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Новый Структура("ОценкаЧЧ,План", ВыборкаДетальныеЗаписи.ОценкаЧЧ, ВыборкаДетальныеЗаписи.План);
	Иначе
		Возврат Новый Структура("ОценкаЧЧ,План", 0, "");
	КонецЕсли;	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;

КонецФункции

Функция УдалитьЗапись(Проект, ИД, Дата, Пользователь = Неопределено) экспорт
	
	Если Пользователь = Неопределено Тогда
	
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	КонецЕсли;

	НаборЗаписей = СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Проект.Установить(Проект);
	НаборЗаписей.Отбор.ИД.Установить(ИД);
	НаборЗаписей.Отбор.Дата.Установить(Дата);
	НаборЗаписей.Записать();	
	
КонецФункции

