
Функция ЗаписатьЗначение(СодержаниеДня, Дата, Описание) Экспорт

	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекущееЗначение = ПрочитатьЗначение(СодержаниеДня, Дата, Пользователь);
	
	Если ТекущееЗначение.Описание <> Описание Тогда
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.СодержаниеДня = СодержаниеДня;
		МенеджерЗаписи.Дата = Дата;
		МенеджерЗаписи.Пользователь = Пользователь;
		
		МенеджерЗаписи.Описание = Описание;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;		
КонецФункции
 
Функция ПрочитатьЗначение(СодержаниеДня, Дата, Пользователь) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОписаниеДняПоСодержанию.СодержаниеДня,
		|	ОписаниеДняПоСодержанию.Пользователь,
		|	ОписаниеДняПоСодержанию.Дата,
		|	ОписаниеДняПоСодержанию.Описание
		|ИЗ
		|	РегистрСведений.ОписаниеДняПоСодержанию КАК ОписаниеДняПоСодержанию
		|ГДЕ
		|	ОписаниеДняПоСодержанию.Дата = &Дата
		|	И ОписаниеДняПоСодержанию.Пользователь = &Пользователь
		|	И ОписаниеДняПоСодержанию.СодержаниеДня = &СодержаниеДня";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("СодержаниеДня", СодержаниеДня);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Новый Структура("Описание", ВыборкаДетальныеЗаписи.Описание);
	Иначе
		Возврат Новый Структура("Описание", "");
	КонецЕсли;	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;

КонецФункции