// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция ПолучитьТаблицуЗадач(Дата)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрТипыПроектов.ТипПроекта,
		|	СпрТипыПроектов.Дата,
		|	РСПлан.Проект,
		|	РСПлан.ИД,
		|	РСПлан.Пользователь,
		|	РСПлан.План,
		|	РСПлан.ОценкаЧЧ,
		|	РСФакт.РезультатПоПлану,
		|	РСФакт.ФактЧЧ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТипыИПроекты.Ссылка КАК ТипПроекта,
		|		&ВыбраннаяДата КАК Дата
		|	ИЗ
		|		Справочник.ТипыИПроекты КАК ТипыИПроекты
		|	ГДЕ
		|		НЕ ТипыИПроекты.ПометкаУдаления
		|		И ТипыИПроекты.ЭтоГруппа
		|		И ТипыИПроекты.Родитель = &ПустойРодитель) КАК СпрТипыПроектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РСПлан.Проект КАК Проект,
		|			РСПлан.ИД КАК ИД,
		|			РСПлан.Дата КАК Дата,
		|			РСПлан.Пользователь КАК Пользователь,
		|			РСПлан.План КАК План,
		|			РСПлан.ОценкаЧЧ КАК ОценкаЧЧ,
		|			РСПлан.Проект.Родитель КАК ТипПроекта
		|		ИЗ
		|			РегистрСведений.План КАК РСПлан
		|		ГДЕ
		|			РСПлан.Дата = &ВыбраннаяДата) КАК РСПлан
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				РСРезультатПоПлану.Дата КАК Дата,
		|				РСРезультатПоПлану.Проект КАК Проект,
		|				РСРезультатПоПлану.ИД КАК ИД,
		|				РСРезультатПоПлану.РезультатПоПлану КАК РезультатПоПлану,
		|				РСРезультатПоПлану.ФактЧЧ КАК ФактЧЧ,
		|				РСРезультатПоПлану.Проект.Родитель КАК ТипПроекта
		|			ИЗ
		|				РегистрСведений.РезультатПоПлану КАК РСРезультатПоПлану
		|			ГДЕ
		|				РСРезультатПоПлану.Дата = &ВыбраннаяДата) КАК РСФакт
		|			ПО РСПлан.ИД = РСФакт.ИД
		|				И РСПлан.Дата = РСФакт.Дата
		|		ПО СпрТипыПроектов.ТипПроекта = РСПлан.ТипПроекта
		|			И СпрТипыПроектов.Дата = РСПлан.Дата";
	
	Запрос.УстановитьПараметр("ВыбраннаяДата", Дата);
	Запрос.УстановитьПараметр("ПустойРодитель", Справочники.ТипыИПроекты.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;

КонецФункции // ЗаполнитьТаблицуЗадач()
