
// СтандартныеПодсистемы

#Область ОписаниеПеременных

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;
Перем КомпонентБО Экспорт;

#КонецОбласти

// Конец СтандартныеПодсистемы


#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	ПодключитьБиблиотеку("clipboard.dll");
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

#КонецОбласти

Процедура ПодключитьБиблиотеку(ИмяБиблиотеки)

// проверка наличия библиотеки Clipboard
	ИмяФайла = КаталогПрограммы() + ИмяБиблиотеки;
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		ИзвлечьИЗаписатьБиблиотеку(ИмяФайла, ИмяБиблиотеки);
	КонецЕсли;
	
	Если ИмяБиблиотеки = "clipboard.dll" Тогда
		стрМестоположениеВнешнейКомпоненты = "AddIn.clipboard";
	ИначеЕсли ИмяБиблиотеки = "" Тогда
		
	КонецЕсли; 
	
	Попытка
		//ПодключитьВнешнююКомпоненту(ИмяФайла);
		ПодключитьВнешнююКомпоненту(стрМестоположениеВнешнейКомпоненты);
		//ЗагрузитьВнешнююКомпоненту(ИмяФайла);
		Попытка
			КомпонентБО = Новый(стрМестоположениеВнешнейКомпоненты);
			Сообщить("Подключен объект компоненты " + ИмяБиблиотеки, СтатусСообщения.Важное);
		Исключение
			Сообщить("Не удалось создать объект компоненты " + ИмяБиблиотеки, СтатусСообщения.Важное);
		КонецПопытки;	
	Исключение
		Сообщить("Компонента " + ИмяБиблиотеки + " не найдена!", СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры
 
Процедура ИзвлечьИЗаписатьБиблиотеку(ИмяФайла, ИмяБиблиотеки)
	// пробует записать библиотеку в каталог программу,
	//	если не заработает надо зарегистрировать библиотеку командой regsvr32
	Попытка
		Библиотека = ПолучитьФайлБиблиотеки(ИмяБиблиотеки);
		Библиотека.Записать(ИмяФайла);
	Исключение
		Сообщить("Ошибка при записи файла: " + ИмяФайла + Символы.ПС
						+ ОписаниеОшибки() + "
						|Файл не записан.
						|Возможно у вас отсутствуют права доступа к папке. Обратитесь к администратору.", СтатусСообщения.Важное);
	КонецПопытки;
			
КонецПроцедуры
Функция ПолучитьФайлБиблиотеки(ИмяБиблиотеки)
	
	Если ИмяБиблиотеки = "clipboard.dll" Тогда
		ИмяМакета = "Библиотека_clipboard_dll";
	ИначеЕсли ИмяБиблиотеки = "" Тогда
		
	КонецЕсли;
	
	Возврат СерверВызовСервера.ПолучитьОбщийМакетНаСервере(ИмяМакета);

КонецФункции
 
