
Функция ЗаписатьЗначение(Дата, ддКартинка, Описание) Экспорт

	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.ИД = Новый УникальныйИдентификатор;
	
	МенеджерЗаписи.Картинка = Новый ХранилищеЗначения(ддКартинка);
	МенеджерЗаписи.Описание = Описание;
	
	МенеджерЗаписи.Записать();
		
КонецФункции
 
Функция ПрочитатьЗначение(Пользователь, Дата, ИД = Неопределено) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииДня.Пользователь,
		|	ФотографииДня.Дата,
		|	ФотографииДня.ИД,
		|	ФотографииДня.Картинка КАК ДанныеКартинки,
		|	ФотографииДня.Описание
		|ИЗ
		|	РегистрСведений.ФотографииДня КАК ФотографииДня
		|ГДЕ
		|	ФотографииДня.Пользователь = &Пользователь
		|	И ФотографииДня.Дата = &Дата";
		
	Если ИД <> Неопределено Тогда
	
		Запрос.Текст = Запрос.Текст + " И ФотографииДня.ИД = &ИД";
		Запрос.УстановитьПараметр("ИД", ИД);
		
	КонецЕсли; 
		
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Таблица = РезультатЗапроса.Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Возврат Новый Структура("Пользователь, Дата, ИД, ДанныеКартинки, Описание",
			Таблица[0].Пользователь, Таблица[0].Дата, Таблица[0].ИД, Таблица[0].ДанныеКартинки, Таблица[0].Описание);
	Иначе
		Возврат Таблица;
	КонецЕсли; 
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
КонецФункции