#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.СтартОтложенныхПроцессов);
	Если ЭтотОбъект.Значение Тогда
		Если РегламентноеЗадание.Расписание.ВремяНачала = Дата("00010101070000") Тогда 
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораВТечениеДня = 900;
			Расписание.ВремяНачала = Дата("00000000");
			Расписание.ПериодПовтораДней = 1;
			РегламентноеЗадание.Расписание = Расписание;
			РегламентноеЗадание.Записать();
		КонецЕсли;
	Иначе
		Если РегламентноеЗадание.Расписание.ПериодПовтораВТечениеДня = 900 Тогда
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораВТечениеДня = 0;
			Расписание.ВремяНачала = Дата("00010101070000");
			Расписание.ПериодПовтораДней = 1;
			РегламентноеЗадание.Расписание = Расписание;
			РегламентноеЗадание.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
